In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [119]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [121]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [15]:
# 딕셔너리로 데이터프레임을 만들면 데이터프레임의 킷값은 열 인덱스가 된다. 그리고 밸류가 데이터로 오게 된다.
# 행 인덱스 번호는 자동으로 0번부터 부여된다.

In [16]:
frame.head()# 앞에서 5개의 값을 불려온다.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [17]:
frame.head(3)# 디폴트인 5 외의 다른 숫자만큼 출력 가능하다.

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [18]:
frame.tail()# 뒤에서 5개의 값을 불려온다.

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [19]:
df = frame.head(3)
df # 데이터의 일부를 저장할 때 이런 방식으로 저장하는 경우가 많다. 생각보다 자주 사용하게 될 것이다. 
#일부 자료만 추출해서 사용하는 기술이다.

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [20]:
#만약 데이터프레임 순서를 바꾸기를 원한다면(열에 대한 순서를 변경하길 원한다면)

In [23]:
frame2 = pd.DataFrame(data, columns = ['debt','year', 'state', 'pop'])#순서를 바꾸는 것은 물론 새로운 열을 추가하는 것도 가능하다.
frame2

  debt  year   state  pop
0  NaN  2000    Ohio  1.5
1  NaN  2001    Ohio  1.7
2  NaN  2002    Ohio  3.6
3  NaN  2001  Nevada  2.4
4  NaN  2002  Nevada  2.9
5  NaN  2003  Nevada  3.2

In [24]:
frame2.columns #열 이름을 찾기 위해서 쓰는 컬럼스

Index(['debt', 'year', 'state', 'pop'], dtype='object')

In [25]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [26]:
frame2.state# 킷값에 담긴 요소확인. 위와 동일한 결과를 가져온다.

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [29]:
frame2.loc[1]#1번행 위치에 대한 정보를 추출한다. 
# 데이터타입이 현재 오브젝트인 것을 알 수 있는데

debt      NaN
year     2001
state    Ohio
pop       1.7
Name: 1, dtype: object

In [31]:
# 1차원 : 리스트는 다양한 자료들이 저장되어진다. 벡터는 동일한 자료들이 저장된다. 시리즈(벡터. 열의 구성요소 하나하나를 말함)도 포함한다.
# 2차원 : 리스트의 리스트, 배열(행렬-넘파이)구조로 정의된다. 데이터프레임(판다스)도 2차원 형식이다. 
#킷값 부여위치에 따라 행백터. 열벡터가 달라진다.

In [33]:
frame2.iloc[2]#ioc와 결과는 같지만 공식은 다르다. 만약 행인덱스가 묵시적으로 부여되는 행인덱스의 이름과 다를 경우 다르게 나올 것이다.
# 묵시적으로 부여되는 번호는 항상 0번부터 부여된다.

debt      NaN
year     2002
state    Ohio
pop       3.6
Name: 2, dtype: object

In [34]:
type(frame2.iloc[2])# 하나 이상의 여러 시리즈가 모인 시리즈 구조가 데이터 모임이라고 할 수 있다..
#시리즈 첫번째 열에는 행 이름이 온다.

pandas.core.series.Series

In [37]:
frame2['debt'] =16.5
frame2 # 하나의 변수가 열 전체에 저장된다.

   debt  year   state  pop
0  16.5  2000    Ohio  1.5
1  16.5  2001    Ohio  1.7
2  16.5  2002    Ohio  3.6
3  16.5  2001  Nevada  2.4
4  16.5  2002  Nevada  2.9
5  16.5  2003  Nevada  3.2

In [39]:
frame2['debt']=np.arange(10,16) # 데이터 길이가 맞지 않으면 애러가 발생할 것이다. 
frame2 #특정값 저장은 이러한 식으로도 가능하다.

   debt  year   state  pop
0    10  2000    Ohio  1.5
1    11  2001    Ohio  1.7
2    12  2002    Ohio  3.6
3    13  2001  Nevada  2.4
4    14  2002  Nevada  2.9
5    15  2003  Nevada  3.2

In [40]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [41]:
val# 이번에는 시리즈 형식으로 만들었다.
#인덱스 값이 행 인덱스로 온 점도 있다.

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [42]:
frame2['debt'] = val
frame2#저장되지 않았다.

   debt  year   state  pop
0   NaN  2000    Ohio  1.5
1   NaN  2001    Ohio  1.7
2   NaN  2002    Ohio  3.6
3   NaN  2001  Nevada  2.4
4   NaN  2002  Nevada  2.9
5   NaN  2003  Nevada  3.2

In [43]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [45]:
frame2['state'] =='Ohio' #이런 식으로 확인 가능하다.

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [46]:
frame2[frame2['state'] =='Ohio' ] # 이 방법 매우 자주 쓴다. 기억하자.

   debt  year state  pop
0   NaN  2000  Ohio  1.5
1   NaN  2001  Ohio  1.7
2   NaN  2002  Ohio  3.6

In [47]:
frame2[frame2['state'] =='Ohio' ]['year']# 특정 열을 추출할 때는 뒤에 대괄호 열고 작성한다. 현재것은 오하이오 자료의 연도만 추출했다.

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [48]:
frame2['state'] =='Ohio'
#feature engineering(특성공학)은 자격증 시험에 자주 나온다. 
#기존의 데이터 프레임 열들을 대상으로 연산을 수행하여 새로운 열을 생성하는 과정을 말한다. 파생변수를 생성하는 과정이다.
# 예를들면 국어, 영어, 수학이라는 점수가 저장된 데이터프레임에서 국영수 점수를 더해서 총점이라는 요소를 추가하는 것이다.
# 유도되어지는 변수를 파생변수라고 하는데 파생변수를 만드는 작업을 특성공학이라고 하는 것이다.
# derived variable(파생변수)

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [49]:
#열을 추가해서 eastern을 정의하고 싶다. 동부면 true, 아니면false를 추가하고 샆다고 하자.
# 오하이오는 동부고 네바다는 폴스다.

In [50]:
frame2['eastern']=frame2['state']=='Ohio'

In [51]:
frame2

   debt  year   state  pop  eastern
0   NaN  2000    Ohio  1.5     True
1   NaN  2001    Ohio  1.7     True
2   NaN  2002    Ohio  3.6     True
3   NaN  2001  Nevada  2.4    False
4   NaN  2002  Nevada  2.9    False
5   NaN  2003  Nevada  3.2    False

In [52]:
#만약 제거하려고 한다면 이렇게 하자.
del frame2['eastern']
frame2.columns

Index(['debt', 'year', 'state', 'pop'], dtype='object')

In [53]:
#데이터프레임간의 연산방법

In [55]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}} #딕셔너리 내부에 딕셔너리가 있는 구조

In [58]:
frame3 = pd.DataFrame(populations)
frame3 #외부키는 열 내부키는 행 인덱스로 간다. 그리고 값들이 데이터로 오게 된다.
# 이중구조로 정의된 경우는 이와 같다.

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [59]:
frame3.loc[0] #키가 존재하지 않기에 애러가 뜬다. 0번은 존재하지 않는다

KeyError: 0

In [60]:
frame3.iloc[0] #묵시적으로 0번부터 부여되어있기에 0번 인덱스가 존재하지 않아도 행의 0번 위치대의 자료가 출력된다.

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

In [61]:
frame3.loc[2000]  # loc는 명시적인 이름을 추가하는 경우에 자료가 출력된다.

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

In [62]:
frame3.iloc[2]  #순방향 방식으로 마지막을 출력하는 경우이다. 만약 역순으로 출력한다면 어떨까?

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [63]:
frame3.iloc[-1] # -1을 붙여서 뒤부터 참조하는 것은 여기서도 동일하다.

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [64]:
frame3.loc[-1]#당연히 안될것이다. 명시적인 이름을 붙여야 하는 Ioc에 될 수가 없다.

KeyError: -1

In [65]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [68]:
pd.DataFrame(populations, index =[1999,2000,2001,2002,2003] )
# 직접 수동으로 인덱스를 부여 가능하다. 그리고 추가를 하는 것도 가능하다.
# 인덱스가 존재하지 않는 경우 nan이 들어오는 것을 알 수 있다.

      Ohio  Nevada
1999   NaN     NaN
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [71]:
frame3['Ohio'][:-1] # 맨 뒤의 것이 사라지고 바로 앞의 것부터 나오게 된다. 뒤에서부터 일정 데이터를 빼고 참조하는 것이다.

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [72]:
frame3['Nevada'][:2] # 앞에서부터 2개까지만 참조한 것이다. 참조범위는 위와 동일하다.

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [79]:
pd.DataFrame({'Ohio':frame3['Ohio'][:-1],
'Nevada':frame3['Nevada'][:2]})#원하는 데이터를 추출하여 새로운 데이터프레임에 적용한다.

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [75]:
frame3.to_numpy() # 배열로 변경이 되었다.
# 파이썬에서는 리스트 튜플 딕셔러니 집합등이 존재한다.
# 넘파이에는 배열이 있다. 리스트보다 빠르다. 다차원 배열로 가능하다. 1차월(벡터), 2차원(행렬), 3차원부터는 n차원
# 판다스는 데이터프레임, 시리즈로 나뉜다. 데이터프레임은 2차원 구조로 열단위로 데이터타입이 다를 수 있다. 시리즈는 1차원 구조이다. 
# 즉 위에 있던 것은 판다스의 자료를 넘파이로 바꾼 것으로 데이터프레임을 행렬로 바꾼 것이다.

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [76]:
frame2 # 판다스 방식의 세련된 모양새

   debt  year   state  pop
0   NaN  2000    Ohio  1.5
1   NaN  2001    Ohio  1.7
2   NaN  2002    Ohio  3.6
3   NaN  2001  Nevada  2.4
4   NaN  2002  Nevada  2.9
5   NaN  2003  Nevada  3.2

In [77]:
frame2.to_numpy() # 배열로 바꾼 결과물. 데이터타입 전체는 오브젝트이다.(오브젝트 = 문자타입)

array([[nan, 2000, 'Ohio', 1.5],
       [nan, 2001, 'Ohio', 1.7],
       [nan, 2002, 'Ohio', 3.6],
       [nan, 2001, 'Nevada', 2.4],
       [nan, 2002, 'Nevada', 2.9],
       [nan, 2003, 'Nevada', 3.2]], dtype=object)

In [84]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [85]:
obj.loc['a'] # a의 위치를 참조하는 명령이다. loc는 명시적이다.

0

In [86]:
obj.iloc[0] # iloc는 묵시적인 위치기에 이렇게 하면 된다.

0

In [87]:
obj.loc['c']

2

In [88]:
obj.iloc[-1]# loc 와 iloc를 구분할 수 있어야 한다.

2

In [90]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [91]:
obj.index[1:]

Index(['b', 'c'], dtype='object')

In [94]:
obj2 = pd.Series([1.5, -2.5, 0], index = np.arange(100,103))
obj2
#인덱스를 직접 부여하는 것도 가능하다.

100    1.5
101   -2.5
102    0.0
dtype: float64

In [95]:
obj2.index

Int64Index([100, 101, 102], dtype='int64')

In [96]:
101 in obj2.index#101이 내부에 존재하는가?

True

In [97]:
103 in obj2.index#103이 내부에 존재하는가? - 존재하지 않는다.

False

In [98]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [99]:
2003 in frame3.index

False

In [101]:
'Califonia' in frame3.columns #내부 속성에서도 in 연산자를 이용하는 것이 가능하다. 존재여부 확인이 가능하다.

False

In [102]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [103]:
obj.reindex(['a','b','c','d','e'])# 인덱스 재지정 함수이다.
#인덱스 재지정이 이루어지고 기존의 순서는 무시되었다. 값도 해당위치 것을 참조해서 출력되었으며 새로운 인덱스가 추가되었다.

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [104]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [111]:
obj3.reindex([0,1,2,3,4,5])#이런 식으로 부여하는 것이 가능하다면?

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [108]:
obj3.reindex(np.arange(6)) #위와 동일하다.

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [113]:
obj3.reindex(np.arange(6), method = "ffill")#매서드는 속성을 말하는데 기존의 인덱스는 무시하고 새로 지정하겠다는 것이다.
#ffill은 순방향으로 위에서 아래로 정렬된다. (forward)
#기존의 nan의 자리가 채워진다. 위에 있는 값들이 채워졌다.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [114]:
obj3.reindex(np.arange(6), method = "bfill")
#bfill은 역방향으로 아래에서 위로 정렬된다.(backward)
#아래의 데이터가 위쪽방향으로 채워졌다.

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [115]:
# 위의 ffill, bfill은 누락값을 채워넣는 용도로 사용한다. 연속성이 있는 데이터에 누락값을 전의 것으로 채워넣는 것이다.
# 결측값을 대체하는 방법이다. ffill, bfill, 보간법, 회귀모델, knn등도 존재한다.

In [117]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],#행인덱스
                     columns=["Ohio", "Texas", "California"])#열인덱스
frame # 데이터타입은 정수이다.

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [118]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2 # nan이 추가되는 순간부터 데이터타입이 실수가 되었다. 아까것은 정수였다.

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [131]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])#정수 뒤에 점이 붙어있으면 실수로 간주한다. 
#0부터 4까지에 대해서 입력되었다.

obj
# 특정 데이터를 삭제하는 방법을 알아보자.

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [124]:
new_obj = obj.drop("c") # C 라는 인덱스가 제거되었다.
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [125]:
obj # 제거된 결과를 obj에 저장하고 드랍한 데이터를 new_obj에 담은 것을 확인할 수 있다.

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [132]:
obj.drop("c",inplace = True)
obj#드랍이후 내부저장하면 원본도 변화하는 것을 알 수 있다.

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [133]:
obj.drop(["a","d"],inplace = True)#만약 2개 이상 드랍을 하기 위해서는 리스트로 묶는 방법을 통해 제거하자.

In [134]:
obj

b    1.0
e    4.0
dtype: float64

In [135]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
#특정행이나 특정열을 참조하는 법을 알아보자.
data.loc['Colorado','Ohio'] # 두개를 한번에 하려면 애러가 난다. 리스트를 두 개를 겹치자.

KeyError: 'Ohio'

In [138]:
data.loc[['Colorado','Ohio']] # 여기서는 콜로라도를 먼저 기술했기 때문에 오하이오가 이후에 출력되었다.

          one  two  three  four
Colorado    4    5      6     7
Ohio        0    1      2     3

In [140]:
data[['two','four']]# 열도 이런 식으로 출력이 가능하다.

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [141]:
data.drop(['Colorado','Ohio'])#두 개를 한꺼번에 제거하는 것도 리스트에 묶어서 할 수 있다.
# 사실 data.drop(index = ['Colorado','Ohio'])랑 같다. 인덱스가 생략되어있다.

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data.drop('two') #제거는 디폴트가 행인덱스를 기준으로 제거하기 때문이다. 열을 지정해야 할 것이다. axis를 써야할 것이다.

KeyError: "['two'] not found in axis"

In [143]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data.drop(['two'], axis = 1) #두 개 이상 제거할때는 대괄호를 쓴다.

In [ ]:
data.drop(['two'], axis = 'columns') # 열 제거방법이다.

In [ ]:
data.drop(columns='two')
data.drop(columns=['two']) #이 두 가지 방법도 결과는 같다.

In [144]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
# 문제 : 여기서 1열과 3열을 제거하려면?
data.drop(columns=['one','three'])

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [146]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [147]:
obj['b']

1.0

In [148]:
obj.loc['b']

1.0

In [149]:
obj[1]

1.0

In [150]:
obj.iloc[1]

1.0

In [151]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [152]:
obj.iloc[2:4]

c    2.0
d    3.0
dtype: float64

In [154]:
obj[1,3] #떨어져있는 두 요소는 대괄호로 묶어야 한다.

KeyError: 'key of type tuple not found and not a MultiIndex'

In [155]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [156]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [157]:
#문제 :obj에서 2보다 작은 데이터를 추출하시오.
obj[:2]

a    0.0
b    1.0
dtype: float64

In [158]:
obj[obj<2]#괄호를 이용하는 방법도 존재한다. 불린참조는 많이 쓰인다.

a    0.0
b    1.0
dtype: float64

In [159]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [160]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [162]:
obj1.loc[1]

3

In [166]:
obj1.iloc[2]

3

In [165]:
obj1.iloc[-1]

3

In [167]:
obj1.iloc[[2,0]]

1    3
2    1
dtype: int64

In [168]:
obj2

a    1
b    2
c    3
dtype: int64

In [169]:
obj2.iloc[1:2]#숫자범위를 하면 1개만 결과가나온다. 2 미만이다.

b    2
dtype: int64

In [171]:
obj2.loc['b':'c']#끝위치가 포함된다. 콜론 뒤의 위치도 포함되는 것이다.

b    2
c    3
dtype: int64

In [172]:
obj2.loc['b':'c'] = 99

In [173]:
obj2 # 여러개의 변수가 변했다. 일괄적으로 변경하는 것도 이러한 방식으로 가능하다.

a     1
b    99
c    99
dtype: int64

In [238]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [180]:
#three에서 데이터값이 5보다 큰 데이터를 추출하라. 
data["three"] [data["three"] > 5]#three부분은 앞뒤 다 붙일 수 있다data [data["three"] > 5]["three"] 이것도 가능하다.

Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [183]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [184]:
data.loc['Colorado'].loc[["two","three"]]#뒤에 붙이는 loc도 가능하다.

two      5
three    6
Name: Colorado, dtype: int32

In [185]:
data.loc['Colorado', "two"] # 이렇게 쓰는 방법도 존재한다. 행과 열을 같이 기재하는 것이다.

5

In [186]:
data.loc['Colorado', ["two","three"]] #두 개의 행을 한꺼번에 참조하는 것도 가능하다.

two      5
three    6
Name: Colorado, dtype: int32

In [188]:
data.iloc[[1,2]]#만약 여기서 두 개의 열을 출력한다면?

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [189]:
data.iloc[[1,2], 3]#직접 기재하는 방식은 이렇게 할 수 있을 것이다.

Colorado     7
Utah        11
Name: four, dtype: int32

In [190]:
data.iloc[[1,2], [3,0]] # 어렵지 않을 것이다.

          four  one
Colorado     7    4
Utah        11    8

In [191]:
data.iloc[[1,2]]['four']
data.iloc[[1,2],3]
data.iloc[[1,2],[3,0]]
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [193]:
#오하이오, 유타 출력을 한다면
data.iloc[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [195]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [204]:
data.iloc[::3][data.three>5]

C:\Users\user\AppData\Local\Temp\ipykernel_11736\808566559.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  data.iloc[::3][data.three>5]

          one  two  three  four
New York   12   13     14    15

In [199]:
data.iloc[:3,:3][data.three.5]

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3397114301.py, line 1)

In [205]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [208]:
#ser[-1]
ser.iloc[-1]

2.0

In [209]:
data.ioc[:,'one']
data.iloc[:,0]=1

AttributeError: 'DataFrame' object has no attribute 'ioc'

In [230]:
data.iloc[:,0]=111#열단위 데이터 입력
data

          one  two  three  four
Ohio      111    1      2     3
Colorado  111    5      6     7
Utah      111    9     10    11
New York  111   13     14    15

In [231]:
data.iloc[2] = 555

In [232]:
data#이런 식으로 일괄변화가 가능하다.

          one  two  three  four
Ohio      111    1      2     3
Colorado  111    5      6     7
Utah      555  555    555   555
New York  111   13     14    15

In [239]:
#data의 four 열 값이 5보다 크면 100으로 변경하시오.
data[data['four'] > 5] = 100

In [240]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado  100  100    100   100
Utah      100  100    100   100
New York  100  100    100   100

In [241]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s1
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [242]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [243]:
s1 + s2#nan이 한쪽이라도 존재하면 결과는 Nan이다. 시리즈간의 연산은 행 인덱스가 동일한것 끼리 연산이 이루어지는 것이다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [244]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [245]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [246]:
df1 + df2 # 아까 사례의 극단적인 케이스.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [247]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1

   A
0  1
1  2

In [248]:
df2

   B
0  3
1  4

In [250]:
df1 + df2 #A열과 B열은 별도의 열이다.

    A   B
0 NaN NaN
1 NaN NaN

In [251]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [252]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [253]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [260]:
df2['b'][1] #참조하는 것은 상당히 많이 하는 작업이다.

6.0

In [266]:
df2.iloc[1]['b'] # 연습이 필요하다.
df2.iloc[1].loc['b']
#만약 엑셀처럼 사용하고 싶다면
df2.iloc[1,1] #마치 셀 처럼 가능하다.

6.0

In [267]:
#loc는 문자일때 추출하기, iloc는 묵시적 번호일때 추출하기로 일단 배워보자
df2.iloc[1:2,1:2]  #범위를 쓴다면 이렇게 사용이 가능하다. 좀더 세련된 모습이다.

     b
1  6.0

In [268]:
df2.iloc[1,1] = np.nan

In [269]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [270]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [271]:
df1 + df2 #연산은 예상대로 이루어졌다.

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [272]:
df1.add(df2)#add함수도 동일하다. 그런데 어째서 add함수가 있는가?

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [273]:
df1.add(df2, fill_value=0) # 값이 없으면 0으로 채우라는 뜻이다. 즉 nan이 존재하지 않게 된다.

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [274]:
df2.add(df1, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
# 다만 nan을 0으로 채울 때는 이유가 존재해야 한다. 데이터 오염이 이루어질 수 있기 때문이다.
# 시험을 안 본 것과 시험에서 0점을 받은 것은 아예 다르다.
# 그래서 어느정도의 지식이 요구된다.

In [276]:
1 / df1 # 첫칸만 무한이 나오고 나머지가 출력되었다. 연산은 한번에 적용 가능하다.

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [277]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [280]:
arr[0]

array([0., 1., 2., 3.])

In [281]:
arr[0].shape # 차원과 데이터 갯수를 알 수 있다.

(4,)

In [282]:
arr.shape# 2차원의 데이터를 알 수 있다.

(3, 4)

In [283]:
arr - arr [0] # 이 것이 가능한 이유가 궁금하다. 2차원에 1차원을 뺀 것이다. 두개는 구조가 다르다.
# 브로드캐스팅은 구조가 서로 다른 데이터끼리 연산이 가능하도록 해주는 작업이다.
# 작은 차원이 큰 차원으로 변환이 되어 2차원끼리 뺀 것이다. 
#즉 ([0., 1., 2., 3.])이 아래로 복사해서 3개가 만들어진 것이다.
# 이후 엘리먼트(요소)끼리 연산을 하게 된다. 
# 브로드캐스팅이 모든 상황에서 되지는 않는다. 그래도 차원이 다른 구조끼리 연산이 가능하다는 것은 알아두자.

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [286]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [288]:
ser = frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [289]:
frame - ser # 이번과 같은 경우도 브로드캐스팅이 된 경우이다.

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [290]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [291]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [292]:
frame + series2 # b와 e가 브로드캐스팅이 되었으며 f는 새로운 열로 생성된 것을 볼 수 있다.

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [ ]:
# 데이터 분석에는 그 분야에 대한 지식을 갖춰야 한다. 
# 그 분야에 대한 지식이 없을 시에는 상관관계를 조사하면서 데이터 분석을 해야한다.
# 즉 관련성을 먼저 파악해야한다.
# 중요하지 않은 열은 과감하게 빼버리는 것이다.
# 원인에 따른 결과는 인과관계, 그리고 상관관계도 존재한다. 결과가 나온 이후 원인이 되는 요인이다. 
# 예를들면 교회가 많은 도시에 범죄수가 많다 라고 해서 교회가 범죄의 소굴이다라는 이야기를 하면 곤란하다.
# 왜냐하면 교회가 많은 도시는 인구가 많은 도시기 때문이다. 인구가 많은 도시는 범죄가 많다.
#

In [293]:
df= pd.read_csv("titanic/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [295]:
df[df.loc[:]["Age"]>70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [301]:
df[df["Age"]==58]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S
487,488,0,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C
659,660,0,1,"Newell, Mr. Arthur Webster",male,58.0,0,2,35273,113.2750,D48,C

In [303]:
#1번 문제
len(df[df["Embarked"]=="C"])

168

In [304]:
#2번 문제
len(df[df["SibSp"]-df["Parch"] == 0])

598

In [306]:
#3번 문제
len(df[df["Pclass"]==1])

216

In [325]:
#4번 문제
len(df[df["Fare"] < 50 ])- len(df[df["Fare"] < 20 ])

215

In [324]:
len(df[(df['Fare'] >= 20) & (df['Fare'] < 50)])

215